# Reset Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetSetIterator..::..Reset Method
AssetSetIterator Class See Also
---
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Reset()
```

Visual Basic
---
```text
Public Overridable Sub Reset
```

Visual C++
---
```text
public:
virtual void Reset()
```

# ### Implements
IEnumerator..::..Reset()()()()
# See Also
AssetSetIterator Class
Autodesk.Revit.DB.Visual Namespace